apache/nuttx/arch/arm/src/lpc54xx/lpc54_serial.c
/****************************************************************************
 * arch/arm/src/lpc54xx/lpc54_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include <nuttx/spinlock.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "lpc54_config.h"
#include "hardware/lpc54_usart.h"
#include "lpc54_clockconfig.h"
#include "lpc54_lowputc.h"
#include "lpc54_serial.h"

#include <arch/board/board.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some sanity checks *******************************************************/

/* Is there at least one USART enabled and configured as a RS-232 device? */

#ifndef HAVE_USART_DEVICE
#  warning "No USARTs enabled"
#endif

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#if defined(HAVE_USART_DEVICE) && defined(USE_SERIALDRIVER)

/* Which USART with be tty0/console and which tty1-4?  The console will
 * always be ttyS0.  If there is no console then will use the lowest
 * numbered USART.
 */

/* First pick the console and ttys0.  This could be any of USART0-5 */

#if defined(CONFIG_USART0_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart0port /* USART0 is console */
#    define TTYS0_DEV           g_uart0port /* USART0 is ttyS0 */
#    define USART0_ASSIGNED     1
#elif defined(CONFIG_USART1_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart1port /* USART1 is console */
#    define TTYS0_DEV           g_uart1port /* USART1 is ttyS0 */
#    define USART1_ASSIGNED     1
#elif defined(CONFIG_USART2_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart2port /* USART2 is console */
#    define TTYS0_DEV           g_uart2port /* USART2 is ttyS0 */
#    define USART2_ASSIGNED     1
#elif defined(CONFIG_USART3_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart3port /* USART3 is console */
#    define TTYS0_DEV           g_uart3port /* USART3 is ttyS0 */
#    define USART3_ASSIGNED     1
#elif defined(CONFIG_USART4_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart4port /* USART4 is console */
#    define TTYS0_DEV           g_uart4port /* USART4 is ttyS0 */
#    define USART4_ASSIGNED     1
#elif defined(CONFIG_USART5_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart5port /* USART5 is console */
#    define TTYS5_DEV           g_uart5port /* USART5 is ttyS0 */
#    define USART5_ASSIGNED     1
#elif defined(CONFIG_USART6_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart6port /* USART6 is console */
#    define TTYS6_DEV           g_uart6port /* USART6 is ttyS0 */
#    define USART6_ASSIGNED     1
#elif defined(CONFIG_USART7_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart7port /* USART7 is console */
#    define TTYS7_DEV           g_uart7port /* USART7 is ttyS0 */
#    define USART7_ASSIGNED     1
#elif defined(CONFIG_USART8_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart8port /* USART8 is console */
#    define TTYS8_DEV           g_uart8port /* USART8 is ttyS0 */
#    define USART8_ASSIGNED     1
#elif defined(CONFIG_USART9_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_uart9port /* USART9 is console */
#    define TTYS9_DEV           g_uart9port /* USART9 is ttyS0 */
#    define USART9_ASSIGNED     1
#else
#  undef CONSOLE_DEV                        /* No console */
#  if defined(HAVE_USART0)
#    define TTYS0_DEV           g_uart0port /* USART0 is ttyS0 */
#    define USART0_ASSIGNED     1
#  elif defined(HAVE_USART1)
#    define TTYS0_DEV           g_uart1port /* USART1 is ttyS0 */
#    define USART1_ASSIGNED     1
#  elif defined(HAVE_USART2)
#    define TTYS0_DEV           g_uart2port /* USART2 is ttyS0 */
#    define USART2_ASSIGNED     1
#  elif defined(HAVE_USART3)
#    define TTYS0_DEV           g_uart3port /* USART3 is ttyS0 */
#    define USART3_ASSIGNED     1
#  elif defined(HAVE_USART4)
#    define TTYS0_DEV           g_uart4port /* USART4 is ttyS0 */
#    define USART4_ASSIGNED     1
#  elif defined(HAVE_USART5)
#    define TTYS0_DEV           g_uart5port /* USART5 is ttyS0 */
#    define USART5_ASSIGNED     1
#  elif defined(HAVE_USART6)
#    define TTYS0_DEV           g_uart6port /* USART6 is ttyS0 */
#    define USART7_ASSIGNED     1
#  elif defined(HAVE_USART7)
#    define TTYS0_DEV           g_uart7port /* USART7 is ttyS0 */
#    define USART7_ASSIGNED     1
#  elif defined(HAVE_USART8)
#    define TTYS0_DEV           g_uart8port /* USART8 is ttyS0 */
#    define USART8_ASSIGNED     1
#  elif defined(HAVE_USART9)
#    define TTYS0_DEV           g_uart9port /* USART9 is ttyS0 */
#    define USART9_ASSIGNED     1
#  endif
#endif

/* Pick ttys1.  This could be any of USART0-9 excluding the console USART. */

#if defined(HAVE_USART0) && !defined(USART0_ASSIGNED)
#  define TTYS1_DEV             g_uart0port /* USART0 is ttyS1 */
#  define USART0_ASSIGNED       1
#elif defined(HAVE_USART1) && !defined(USART1_ASSIGNED)
#  define TTYS1_DEV             g_uart1port /* USART1 is ttyS1 */
#  define USART1_ASSIGNED       1
#elif defined(HAVE_USART2) && !defined(USART2_ASSIGNED)
#  define TTYS1_DEV             g_uart2port /* USART2 is ttyS1 */
#  define USART2_ASSIGNED       1
#elif defined(HAVE_USART3) && !defined(USART3_ASSIGNED)
#  define TTYS1_DEV             g_uart3port /* USART3 is ttyS1 */
#  define USART3_ASSIGNED       1
#elif defined(HAVE_USART4) && !defined(USART4_ASSIGNED)
#  define TTYS1_DEV             g_uart4port /* USART4 is ttyS1 */
#  define USART4_ASSIGNED       1
#elif defined(HAVE_USART5) && !defined(USART5_ASSIGNED)
#  define TTYS1_DEV             g_uart5port /* USART5 is ttyS1 */
#  define USART5_ASSIGNED       1
#elif defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS1_DEV             g_uart6port /* USART6 is ttyS1 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS1_DEV             g_uart7port /* USART7 is ttyS1 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS1_DEV             g_uart8port /* USART8 is ttyS1 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS1_DEV             g_uart9port /* USART9 is ttyS1 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys2.  This could be one of USART1-9. It can't be USART0 because
 * that is either not enabled OR was already assigned as ttyS0 or ttys1.
 * One of USART 1-9 could also be the console.
 */

#if defined(HAVE_USART1) && !defined(USART1_ASSIGNED)
#  define TTYS2_DEV             g_uart1port /* USART1 is ttyS2 */
#  define USART1_ASSIGNED       1
#elif defined(HAVE_USART2) && !defined(USART2_ASSIGNED)
#  define TTYS2_DEV             g_uart2port /* USART2 is ttyS2 */
#  define USART2_ASSIGNED       1
#elif defined(HAVE_USART3) && !defined(USART3_ASSIGNED)
#  define TTYS2_DEV             g_uart3port /* USART3 is ttyS2 */
#  define USART3_ASSIGNED       1
#elif defined(HAVE_USART4) && !defined(USART4_ASSIGNED)
#  define TTYS2_DEV             g_uart4port /* USART4 is ttyS2 */
#  define USART4_ASSIGNED       1
#elif defined(HAVE_USART5) && !defined(USART5_ASSIGNED)
#  define TTYS2_DEV             g_uart5port /* USART5 is ttyS2 */
#  define USART5_ASSIGNED       1
#elif defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS2_DEV             g_uart6port /* USART6 is ttyS2 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS2_DEV             g_uart7port /* USART7 is ttyS2 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS2_DEV             g_uart8port /* USART8 is ttyS2 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS2_DEV             g_uart9port /* USART9 is ttyS2 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys3.  This could be one of USART2-9. It can't be USART0-1 because
 * those are either not enabled OR were already assigned as ttyS0, 1, or 2.
 * One of USART 2-9 could also be the console.
 */

