apache/nuttx/arch/arm/src/lpc54xx/lpc54_serial.c
#if defined(HAVE_USART2) && !defined(USART2_ASSIGNED)
#  define TTYS3_DEV             g_uart2port /* USART2 is ttyS3 */
#  define USART2_ASSIGNED       1
#elif defined(HAVE_USART3) && !defined(USART3_ASSIGNED)
#  define TTYS3_DEV             g_uart3port /* USART3 is ttyS3 */
#  define USART3_ASSIGNED       1
#elif defined(HAVE_USART4) && !defined(USART4_ASSIGNED)
#  define TTYS3_DEV             g_uart4port /* USART4 is ttyS3 */
#  define USART4_ASSIGNED       1
#elif defined(HAVE_USART5) && !defined(USART5_ASSIGNED)
#  define TTYS3_DEV             g_uart5port /* USART5 is ttyS3 */
#  define USART5_ASSIGNED       1
#elif defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS3_DEV             g_uart6port /* USART6 is ttyS3 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS3_DEV             g_uart7port /* USART7 is ttyS3 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS3_DEV             g_uart8port /* USART8 is ttyS3 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS3_DEV             g_uart9port /* USART9 is ttyS3 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys4.  This could be one of USART3-9. It can't be USART0-2 because
 * those are either not enabled OR were already assigned as ttyS0-3.  One
 * of USART 3-9 could also be the console.
 */

#if defined(HAVE_USART3) && !defined(USART3_ASSIGNED)
#  define TTYS4_DEV             g_uart3port /* USART3 is ttyS4 */
#  define USART3_ASSIGNED       1
#elif defined(HAVE_USART4) && !defined(USART4_ASSIGNED)
#  define TTYS4_DEV             g_uart4port /* USART4 is ttyS4 */
#  define USART4_ASSIGNED       1
#elif defined(HAVE_USART5) && !defined(USART5_ASSIGNED)
#  define TTYS4_DEV             g_uart5port /* USART5 is ttyS4 */
#  define USART5_ASSIGNED       1
#elif defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS4_DEV             g_uart6port /* USART6 is ttyS4 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS4_DEV             g_uart7port /* USART7 is ttyS4 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS4_DEV             g_uart8port /* USART8 is ttyS4 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS4_DEV             g_uart9port /* USART9 is ttyS4 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys5.  This could be one of USART4-9. It can't be USART0-3 because
 * those are either not enabled OR were already assigned as ttyS0-4.  One
 * of USART4-9 could also be the console.
 */

#if defined(HAVE_USART4) && !defined(USART4_ASSIGNED)
#  define TTYS5_DEV             g_uart4port /* USART4 is ttyS5 */
#  define USART4_ASSIGNED       1
#elif defined(HAVE_USART5) && !defined(USART5_ASSIGNED)
#  define TTYS5_DEV             g_uart5port /* USART5 is ttyS5 */
#  define USART5_ASSIGNED       1
#elif defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS5_DEV             g_uart6port /* USART6 is ttyS5 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS5_DEV             g_uart7port /* USART7 is ttyS5 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS5_DEV             g_uart8port /* USART8 is ttyS5 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS5_DEV             g_uart9port /* USART9 is ttyS5 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys6.  This could be one of USART5-9. It can't be USART0-4 because
 * those are either not enabled OR were already assigned as ttyS0-5.  One
 * of USART5-9 could also be the console.
 */

#if defined(HAVE_USART5) && !defined(USART5_ASSIGNED)
#  define TTYS6_DEV             g_uart5port /* USART5 is ttyS6 */
#  define USART5_ASSIGNED       1
#elif defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS6_DEV             g_uart6port /* USART6 is ttyS6 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS6_DEV             g_uart7port /* USART7 is ttyS6 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS6_DEV             g_uart8port /* USART8 is ttyS6 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS6_DEV             g_uart9port /* USART9 is ttyS6 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys7.  This could be one of USART6-9. It can't be USART0-5 because
 * those are either not enabled OR were already assigned as ttyS0-6.  One
 * of USART6-9 could also be the console.
 */

#if defined(HAVE_USART6) && !defined(USART6_ASSIGNED)
#  define TTYS7_DEV             g_uart6port /* USART6 is ttyS7 */
#  define USART6_ASSIGNED       1
#elif defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS7_DEV             g_uart7port /* USART7 is ttyS7 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS7_DEV             g_uart8port /* USART8 is ttyS7 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS7_DEV             g_uart9port /* USART9 is ttyS7 */
#  define USART9_ASSIGNED       1
#endif

/* Pick ttys8.  This could be one of USART7-9. It can't be USART0-6 because
 * those are either not enabled OR were already assigned as ttyS0-7.  One
 * of USART7-9 could also be the console.
 */

#if defined(HAVE_USART7) && !defined(USART7_ASSIGNED)
#  define TTYS8_DEV             g_uart7port /* USART7 is ttyS8 */
#  define USART7_ASSIGNED       1
#elif defined(HAVE_USART8) && !defined(USART8_ASSIGNED)
#  define TTYS8_DEV             g_uart8port /* USART8 is ttyS8 */
#  define USART8_ASSIGNED       1
#elif defined(HAVE_USART9) && !defined(USART9_ASSIGNED)
#  define TTYS8_DEV             g_uart9port /* USART9 is ttyS8 */
#  define USART9_ASSIGNED       1
#endif

/* Event sets */

#define CCR_RX_EVENTS       (USART_FIFOINT_RXLVL | USART_FIFOINT_RXERR)
#define CCR_TX_EVENTS       (USART_FIFOINT_TXLVL | USART_FIFOINT_TXERR)
#define CCR_ERROR_EVENTS    (USART_FIFOINT_RXERR | USART_FIFOINT_TXERR | \
                             USART_FIFOINTSTAT_PERINT)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure provides the state of one USART device */

struct lpc54_dev_s
{
  uintptr_t uartbase;  /* Base address of USART registers */
  uint8_t   irq;       /* IRQ associated with this USART */
  spinlock_t lock;     /* Spinlock */

  /* USART configuration */

