apache/nuttx/arch/arm/src/lpc54xx/lpc54_serial.c
  struct uart_config_s config;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  lpc54_setup(struct uart_dev_s *dev);
static void lpc54_shutdown(struct uart_dev_s *dev);
static int  lpc54_attach(struct uart_dev_s *dev);
static void lpc54_detach(struct uart_dev_s *dev);
static int  lpc54_interrupt(int irq, void *context, void *arg);
static int  lpc54_ioctl(struct file *filep, int cmd, unsigned long arg);
static int  lpc54_receive(struct uart_dev_s *dev, unsigned int *status);
static void lpc54_rxint(struct uart_dev_s *dev, bool enable);
static bool lpc54_rxavailable(struct uart_dev_s *dev);
static void lpc54_send(struct uart_dev_s *dev, int ch);
static void lpc54_txint(struct uart_dev_s *dev, bool enable);
static bool lpc54_txready(struct uart_dev_s *dev);
static bool lpc54_txempty(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_uart_ops =
{
  .setup          = lpc54_setup,
  .shutdown       = lpc54_shutdown,
  .attach         = lpc54_attach,
  .detach         = lpc54_detach,
  .ioctl          = lpc54_ioctl,
  .receive        = lpc54_receive,
  .rxint          = lpc54_rxint,
  .rxavailable    = lpc54_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = lpc54_send,
  .txint          = lpc54_txint,
  .txready        = lpc54_txready,
  .txempty        = lpc54_txempty,
};

/* I/O buffers */

#ifdef HAVE_USART0
static char g_uart0rxbuffer[CONFIG_USART0_RXBUFSIZE];
static char g_uart0txbuffer[CONFIG_USART0_TXBUFSIZE];
#endif
#ifdef HAVE_USART1
static char g_uart1rxbuffer[CONFIG_USART1_RXBUFSIZE];
static char g_uart1txbuffer[CONFIG_USART1_TXBUFSIZE];
#endif
#ifdef HAVE_USART2
static char g_uart2rxbuffer[CONFIG_USART2_RXBUFSIZE];
static char g_uart2txbuffer[CONFIG_USART2_TXBUFSIZE];
#endif
#ifdef HAVE_USART3
static char g_uart3rxbuffer[CONFIG_USART3_RXBUFSIZE];
static char g_uart3txbuffer[CONFIG_USART3_TXBUFSIZE];
#endif
#ifdef HAVE_USART4
static char g_uart4rxbuffer[CONFIG_USART4_RXBUFSIZE];
static char g_uart4txbuffer[CONFIG_USART4_TXBUFSIZE];
#endif
#ifdef HAVE_USART5
static char g_uart5rxbuffer[CONFIG_USART5_RXBUFSIZE];
static char g_uart5txbuffer[CONFIG_USART5_TXBUFSIZE];
#endif

/* This describes the state of the LPC54xx USART0 port. */

#ifdef HAVE_USART0
static struct lpc54_dev_s g_uart0priv =
{
  .uartbase       = LPC54_FLEXCOMM0_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM0,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART0_BAUD,
    .fclk         = BOARD_FLEXCOMM0_FCLK,
    .parity       = CONFIG_USART0_PARITY,
    .bits         = CONFIG_USART0_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART0_2STOP,
#ifdef CONFIG_USART0_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART0_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart0port =
{
  .recv     =
  {
    .size   = CONFIG_USART0_RXBUFSIZE,
    .buffer = g_uart0rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART0_TXBUFSIZE,
    .buffer = g_uart0txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart0priv,
};
#endif

/* This describes the state of the LPC54xx USART1 port. */

#ifdef HAVE_USART1
static struct lpc54_dev_s g_uart1priv =
{
  .uartbase       = LPC54_FLEXCOMM1_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM1,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART1_BAUD,
    .fclk         = BOARD_FLEXCOMM1_FCLK,
    .parity       = CONFIG_USART1_PARITY,
    .bits         = CONFIG_USART1_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART1_2STOP,
#ifdef CONFIG_USART1_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART1_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart1port =
{
  .recv     =
  {
    .size   = CONFIG_USART1_RXBUFSIZE,
    .buffer = g_uart1rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART1_TXBUFSIZE,
    .buffer = g_uart1txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart1priv,
};
#endif

/* This describes the state of the LPC54xx USART2 port. */

#ifdef HAVE_USART2
static struct lpc54_dev_s g_uart2priv =
{
  .uartbase       = LPC54_FLEXCOMM2_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM2,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART2_BAUD,
    .fclk         = BOARD_FLEXCOMM2_FCLK,
    .parity       = CONFIG_USART2_PARITY,
    .bits         = CONFIG_USART2_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART2_2STOP,
#ifdef CONFIG_USART2_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART2_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart2port =
{
  .recv     =
  {
    .size   = CONFIG_USART2_RXBUFSIZE,
    .buffer = g_uart2rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART2_TXBUFSIZE,
    .buffer = g_uart2txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart2priv,
};
#endif

/* This describes the state of the LPC54xx USART3 port. */

#ifdef HAVE_USART3
static struct lpc54_dev_s g_uart3priv =
{
  .uartbase       = LPC54_FLEXCOMM3_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM3,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART3_BAUD,
    .fclk         = BOARD_FLEXCOMM3_FCLK,
    .parity       = CONFIG_USART3_PARITY,
    .bits         = CONFIG_USART3_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART3_2STOP,
#ifdef CONFIG_USART3_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART3_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart3port =
{
  .recv     =
  {
    .size   = CONFIG_USART3_RXBUFSIZE,
    .buffer = g_uart3rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART3_TXBUFSIZE,
    .buffer = g_uart3txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart3priv,
};
#endif

/* This describes the state of the LPC54xx USART4 port. */

#ifdef HAVE_USART4
static struct lpc54_dev_s g_uart4priv =
{
  .uartbase       = LPC54_FLEXCOMM4_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM4,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART4_BAUD,
    .fclk         = BOARD_FLEXCOMM4_FCLK,
    .parity       = CONFIG_USART4_PARITY,
    .bits         = CONFIG_USART4_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART4_2STOP,
#ifdef CONFIG_USART4_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART4_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

