apache/nuttx/arch/arm/src/lpc54xx/lpc54_serial.c
static uart_dev_t g_uart4port =
{
  .recv     =
  {
    .size   = CONFIG_USART4_RXBUFSIZE,
    .buffer = g_uart4rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART4_TXBUFSIZE,
    .buffer = g_uart4txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart4priv,
};
#endif

/* This describes the state of the LPC54xx USART5 port. */

#ifdef HAVE_USART5
static struct lpc54_dev_s g_uart5priv =
{
  .uartbase       = LPC54_FLEXCOMM5_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM5,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART5_BAUD,
    .fclk         = BOARD_FLEXCOMM5_FCLK,
    .parity       = CONFIG_USART5_PARITY,
    .bits         = CONFIG_USART5_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART5_2STOP,
#ifdef CONFIG_USART5_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART5_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart5port =
{
  .recv     =
  {
    .size   = CONFIG_USART5_RXBUFSIZE,
    .buffer = g_uart5rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART5_TXBUFSIZE,
    .buffer = g_uart5txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart5priv,
};
#endif

/* This describes the state of the LPC54xx USART6 port. */

#ifdef HAVE_USART6
static struct lpc54_dev_s g_uart6priv =
{
  .uartbase       = LPC54_FLEXCOMM6_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM6,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART6_BAUD,
    .fclk         = BOARD_FLEXCOMM6_FCLK,
    .parity       = CONFIG_USART6_PARITY,
    .bits         = CONFIG_USART6_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART6_2STOP,
#ifdef CONFIG_USART6_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART6_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart6port =
{
  .recv     =
  {
    .size   = CONFIG_USART6_RXBUFSIZE,
    .buffer = g_uart6rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART6_TXBUFSIZE,
    .buffer = g_uart6txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart6priv,
};
#endif

/* This describes the state of the LPC54xx USART7 port. */

#ifdef HAVE_USART7
static struct lpc54_dev_s g_uart7priv =
{
  .uartbase       = LPC54_FLEXCOMM7_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM7,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART7_BAUD,
    .fclk         = BOARD_FLEXCOMM7_FCLK,
    .parity       = CONFIG_USART7_PARITY,
    .bits         = CONFIG_USART7_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART7_2STOP,
#ifdef CONFIG_USART7_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART7_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart7port =
{
  .recv     =
  {
    .size   = CONFIG_USART7_RXBUFSIZE,
    .buffer = g_uart7rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART7_TXBUFSIZE,
    .buffer = g_uart7txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart7priv,
};
#endif

/* This describes the state of the LPC54xx USART8 port. */

#ifdef HAVE_USART8
static struct lpc54_dev_s g_uart8priv =
{
  .uartbase       = LPC54_FLEXCOMM8_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM8,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART8_BAUD,
    .fclk         = BOARD_FLEXCOMM8_FCLK,
    .parity       = CONFIG_USART8_PARITY,
    .bits         = CONFIG_USART8_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART8_2STOP,
#ifdef CONFIG_USART8_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART8_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart8port =
{
  .recv     =
  {
    .size   = CONFIG_USART8_RXBUFSIZE,
    .buffer = g_uart8rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART8_TXBUFSIZE,
    .buffer = g_uart8txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart8priv,
};
#endif

/* This describes the state of the LPC54xx USART9 port. */

#ifdef HAVE_USART9
static struct lpc54_dev_s g_uart9priv =
{
  .uartbase       = LPC54_FLEXCOMM9_BASE,
  .irq            = LPC54_IRQ_FLEXCOMM9,
  .lock           = SP_UNLOCKED,
  .config         =
  {
    .baud         = CONFIG_USART9_BAUD,
    .fclk         = BOARD_FLEXCOMM9_FCLK,
    .parity       = CONFIG_USART9_PARITY,
    .bits         = CONFIG_USART9_BITS,
    .txlevel      = LPC54_USART_FIFO_DEPTH / 2,
    .rxlevel      = 0,
    .stopbits2    = CONFIG_USART9_2STOP,
#ifdef CONFIG_USART9_IFLOWCONTROL
    .iflow        = true,
#endif
#ifdef CONFIG_USART9_OFLOWCONTROL
    .oflow        = true,
#endif
  }
};

static uart_dev_t g_uart9port =
{
  .recv     =
  {
    .size   = CONFIG_USART9_RXBUFSIZE,
    .buffer = g_uart9rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_USART9_TXBUFSIZE,
    .buffer = g_uart9txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart9priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_serialin
 ****************************************************************************/

static inline uint32_t lpc54_serialin(struct lpc54_dev_s *priv,
                                      unsigned int offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: lpc54_serialout
 ****************************************************************************/

static inline void lpc54_serialout(struct lpc54_dev_s *priv,
                                   unsigned int offset, uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: lpc54_fifoint_enable
 ****************************************************************************/

static inline void lpc54_fifoint_enable(struct lpc54_dev_s *priv,
                                        uint32_t intset)
{
  lpc54_serialout(priv, LPC54_USART_FIFOINTENSET_OFFSET, intset);
}

/****************************************************************************
 * Name: lpc54_fifoint_disable
 ****************************************************************************/

